# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример: 
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

from random import randint


l1 = []
l2 = []
n = int(input('Укажите размер списка : '))
for i in range(n):
    l1.append(randint(-50, 50))
print(l1)
for i in range((len(l1)+1)//2):
    print(f'{l1[i]} * {l1[0-1-i]}')
    c = l1[i] * l1[0-1-i]
    # print(c)
    l2.append(c)
print(l2)

